---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarShapeDefinitionBySegments.NumberOfVertices
source: html/2a9082e8-eba4-e0d5-6fd0-6bd4874c8c0a.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeDefinitionBySegments.NumberOfVertices Property

The number of vertices in this shape, always equal to NumberOfSegments + 1.

## Syntax (C#)
```csharp
public int NumberOfVertices { get; }
```